Revit 2026 API

# ElementRecord Properties

---

The ElementRecord type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | WorksetId | Get Id of the workset which owns the element. |

#### Reference

ElementRecord Class

Autodesk.Revit.DB Namespace